Revit 2027 API
IOnLocalLinkSharedCoordinatesSavedCallback Methods
The IOnLocalLinkSharedCoordinatesSavedCallback type exposes the following members.
Methods
Name | Description
OnLocalLinkSharedCoordinatesSaved |  Revit will call this method whenever shared coordinates changes are saved to a linked document provided by an IExternalResourceServer. This call is a notification to the server provider that one of their Revit or DWG links has changed locally, and they should upload the new version back to their server.
Top
See Also
Reference
IOnLocalLinkSharedCoordinatesSavedCallback Interface
Autodesk.Revit.DB Namespace